# GetStatus Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransactionGroup..::..GetStatus Method
TransactionGroup Class See Also
---
Gets the current status of the transaction group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public TransactionStatus GetStatus()
```

Visual Basic
---
```text
Public Function GetStatus As TransactionStatus
```

Visual C++
---
```text
public:
TransactionStatus GetStatus()
```

# ### Return Value
The current status of the transaction group.
# See Also
TransactionGroup Class
Autodesk.Revit.DB Namespace